# Даны три целых числа. Выведите значение наименьшего из них.
def min_three(a, b, c):
    return min(a, b, c)


print(min_three(10, 10, 10))
