# Даны два целых числа. Выведите значение наименьшего из них.
def min_two(a, b):
    return min(a, b)


print(min_two(10, 10))
