# Завершите функцию/метод (в зависимости от языка), чтобы вернуть true/Истина, когда ее аргументом является массив,
# который имеет те же структуры вложенности и ту же соответствующую длину вложенных массивов, что и первый массив.

# def same_structure_as(original, other):
#     a = ''.join([i.replace(i, "2") if i.isdigit() else i for i in str(original)])
#     b = ''.join([i for i in str(other)])
#     return a == b
#
#
# print(same_structure_as([ 1, [ 1, 1 ] ], [ [ 2, 2 ], 2 ] ))
# f"A: {a}\n B: {b}"

def same_structure_as(original, other):
    for i in str(original):
        if i.isdigit():
            print(i)


# print(same_structure_as([-6, -11, -2, [7, -7, -13, [-9, 19, -16, 7]], [5, [10, -7]], 5, 6, -3, 4, 7, -7, [
#     [-17, [-18, -2], -2, [[-9, 19, 16, 1], [], [
#         [12, 18, [5, [12, -20, [-9, 20, -6, [10, [9, -4], -1, [-11, 13, 5, -2]]], [-17, -11]]], [-14, 11]], -8],
#                           [-6, -15]]], [-14, 5], 19, -15], -6, 10, 13, -14, -5, -2, [-6, -7, 13, 11], 17, -11, -1, -10,
#                          -19, [[-14, 8, -11, 1], [19, 6, 3, -12]], 5, -19, 4, -3,
#                          [17, [[13, [-6, -7], -20, [12, -1]], -17, -15, -13], [19, -4], 4],
#                          [-5, [14, -16, -14, 20], 18, -17], -20, 11, 5],
#                         [-3, 8, -16, [7, 20, 1, [-2, -17, -11, -13]], [-10, [8, 10]], 12, 17, -3, -18, 13, 13, [
#                             [-2, [-10, -7], -16, [[-2, -2, -8, 12], [], [[-18, -10, [-10, [-2, -8, [-14, -8, -2,
#                                                                                                     [-4, [18, -17], 0,
#                                                                                                      [-11, -15, -1,
#                                                                                                       -13]]], [3, 12]]],
#                                                                           [-2, -10]], 8], [-3, -11]]], [3, 1], 7, 12],
#                          -20, 19, 6, -11, 12, 5, [-19, 14, 19, 14], -4, -10, -5, -7, 8,
#                          [[-2, -16, -1, -1], [-17, 6, -17, -16]], -13, -17, -2, 11,
#                          [2, [[-7, [2, -6], 17, [-17, 13]], -16, -20, -9], [-19, 3], 4], [18, [-8, 6, -9, 0], 4, -10],
#                          10, 1, 4]))  # True
print(same_structure_as([1, [1, 1]], [[2, 2], 2]))  # False
print(same_structure_as(['[', ']', 1], [1, '[', ']']))  # True
