# Напишите программу, которая считывает длины двух катетов в прямоугольном треугольнике и выводит его площадь.
# Каждое число записано в отдельной строке.
def triangle(b, h):
    return b * h / 2


print(triangle(3, 5))
