# Напишите программу, которая считывает три числа и выводит их сумму. Каждое число записано в отдельной строке.
def sum_three(a, b, c):
    return a + b + c


print(sum_three(7, 3, 6))
